zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxPsi5_bf.h
/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI11 */
#define IFX_PSI5_TEISET_TEI11_OFF (11u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI12 */
#define IFX_PSI5_TEISET_TEI12_OFF (12u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI13 */
#define IFX_PSI5_TEISET_TEI13_OFF (13u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI14 */
#define IFX_PSI5_TEISET_TEI14_OFF (14u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI15 */
#define IFX_PSI5_TEISET_TEI15_OFF (15u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI16 */
#define IFX_PSI5_TEISET_TEI16_OFF (16u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI17 */
#define IFX_PSI5_TEISET_TEI17_OFF (17u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI18 */
#define IFX_PSI5_TEISET_TEI18_OFF (18u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI19 */
#define IFX_PSI5_TEISET_TEI19_OFF (19u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI20 */
#define IFX_PSI5_TEISET_TEI20_OFF (20u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI21 */
#define IFX_PSI5_TEISET_TEI21_OFF (21u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI22 */
#define IFX_PSI5_TEISET_TEI22_OFF (22u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI23 */
#define IFX_PSI5_TEISET_TEI23_OFF (23u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI24 */
#define IFX_PSI5_TEISET_TEI24_OFF (24u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI25 */
#define IFX_PSI5_TEISET_TEI25_OFF (25u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI26 */
#define IFX_PSI5_TEISET_TEI26_OFF (26u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI27 */
#define IFX_PSI5_TEISET_TEI27_OFF (27u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI28 */
#define IFX_PSI5_TEISET_TEI28_OFF (28u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_OFF (29u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_OFF (30u)

/** \brief Length for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_OFF (31u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI0 */
#define IFX_PSI5_CRCISET_CRCI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI0 */
#define IFX_PSI5_CRCISET_CRCI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI0 */
#define IFX_PSI5_CRCISET_CRCI0_OFF (0u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI1 */
#define IFX_PSI5_CRCISET_CRCI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI1 */
#define IFX_PSI5_CRCISET_CRCI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI1 */
#define IFX_PSI5_CRCISET_CRCI1_OFF (1u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_OFF (2u)

/** \brief Length for Ifx_PSI5_CRCISET_Bits.CRCI3 */
#define IFX_PSI5_CRCISET_CRCI3_LEN (1u)

