zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI22 */
#define IFX_PSI5_RMICLR_RMI22_OFF (22u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI23 */
#define IFX_PSI5_RMICLR_RMI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI23 */
#define IFX_PSI5_RMICLR_RMI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI23 */
#define IFX_PSI5_RMICLR_RMI23_OFF (23u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI24 */
#define IFX_PSI5_RMICLR_RMI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI24 */
#define IFX_PSI5_RMICLR_RMI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI24 */
#define IFX_PSI5_RMICLR_RMI24_OFF (24u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI25 */
#define IFX_PSI5_RMICLR_RMI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI25 */
#define IFX_PSI5_RMICLR_RMI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI25 */
#define IFX_PSI5_RMICLR_RMI25_OFF (25u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI26 */
#define IFX_PSI5_RMICLR_RMI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI26 */
#define IFX_PSI5_RMICLR_RMI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI26 */
#define IFX_PSI5_RMICLR_RMI26_OFF (26u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI27 */
#define IFX_PSI5_RMICLR_RMI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI27 */
#define IFX_PSI5_RMICLR_RMI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI27 */
#define IFX_PSI5_RMICLR_RMI27_OFF (27u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI28 */
#define IFX_PSI5_RMICLR_RMI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI28 */
#define IFX_PSI5_RMICLR_RMI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI28 */
#define IFX_PSI5_RMICLR_RMI28_OFF (28u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI29 */
#define IFX_PSI5_RMICLR_RMI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI29 */
#define IFX_PSI5_RMICLR_RMI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI29 */
#define IFX_PSI5_RMICLR_RMI29_OFF (29u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI30 */
#define IFX_PSI5_RMICLR_RMI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI30 */
#define IFX_PSI5_RMICLR_RMI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI30 */
#define IFX_PSI5_RMICLR_RMI30_OFF (30u)

/** \brief Length for Ifx_PSI5_RMICLR_Bits.RMI31 */
#define IFX_PSI5_RMICLR_RMI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_RMICLR_Bits.RMI31 */
#define IFX_PSI5_RMICLR_RMI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RMICLR_Bits.RMI31 */
#define IFX_PSI5_RMICLR_RMI31_OFF (31u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI0 */
#define IFX_PSI5_NBICLR_NBI0_OFF (0u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI1 */
#define IFX_PSI5_NBICLR_NBI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI1 */
#define IFX_PSI5_NBICLR_NBI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI1 */
#define IFX_PSI5_NBICLR_NBI1_OFF (1u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI2 */
#define IFX_PSI5_NBICLR_NBI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI2 */
#define IFX_PSI5_NBICLR_NBI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI2 */
#define IFX_PSI5_NBICLR_NBI2_OFF (2u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI3 */
#define IFX_PSI5_NBICLR_NBI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI3 */
#define IFX_PSI5_NBICLR_NBI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI3 */
#define IFX_PSI5_NBICLR_NBI3_OFF (3u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI4 */
#define IFX_PSI5_NBICLR_NBI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI4 */
#define IFX_PSI5_NBICLR_NBI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI4 */
#define IFX_PSI5_NBICLR_NBI4_OFF (4u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI5 */
#define IFX_PSI5_NBICLR_NBI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI5 */
#define IFX_PSI5_NBICLR_NBI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI5 */
#define IFX_PSI5_NBICLR_NBI5_OFF (5u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI6 */
#define IFX_PSI5_NBICLR_NBI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI6 */
#define IFX_PSI5_NBICLR_NBI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI6 */
#define IFX_PSI5_NBICLR_NBI6_OFF (6u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI7 */
#define IFX_PSI5_NBICLR_NBI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI7 */
#define IFX_PSI5_NBICLR_NBI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI7 */
#define IFX_PSI5_NBICLR_NBI7_OFF (7u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI8 */
#define IFX_PSI5_NBICLR_NBI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI8 */
#define IFX_PSI5_NBICLR_NBI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI8 */
#define IFX_PSI5_NBICLR_NBI8_OFF (8u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI9 */
#define IFX_PSI5_NBICLR_NBI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI9 */
#define IFX_PSI5_NBICLR_NBI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI9 */
#define IFX_PSI5_NBICLR_NBI9_OFF (9u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI10 */
#define IFX_PSI5_NBICLR_NBI10_OFF (10u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI11 */
#define IFX_PSI5_NBICLR_NBI11_OFF (11u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBICLR_Bits.NBI12 */
#define IFX_PSI5_NBICLR_NBI12_OFF (12u)

/** \brief Length for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBICLR_Bits.NBI13 */
#define IFX_PSI5_NBICLR_NBI13_MSK (0x1u)

