zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI28 */
#define IFX_PSI5_TEICLR_TEI28_OFF (28u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI29 */
#define IFX_PSI5_TEICLR_TEI29_OFF (29u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI30 */
#define IFX_PSI5_TEICLR_TEI30_OFF (30u)

/** \brief Length for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEICLR_Bits.TEI31 */
#define IFX_PSI5_TEICLR_TEI31_OFF (31u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI0 */
#define IFX_PSI5_CRCICLR_CRCI0_OFF (0u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI1 */
#define IFX_PSI5_CRCICLR_CRCI1_OFF (1u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI2 */
#define IFX_PSI5_CRCICLR_CRCI2_OFF (2u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI3 */
#define IFX_PSI5_CRCICLR_CRCI3_OFF (3u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI4 */
#define IFX_PSI5_CRCICLR_CRCI4_OFF (4u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI5 */
#define IFX_PSI5_CRCICLR_CRCI5_OFF (5u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI6 */
#define IFX_PSI5_CRCICLR_CRCI6_OFF (6u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI7 */
#define IFX_PSI5_CRCICLR_CRCI7_OFF (7u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI8 */
#define IFX_PSI5_CRCICLR_CRCI8_OFF (8u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI9 */
#define IFX_PSI5_CRCICLR_CRCI9_OFF (9u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI10 */
#define IFX_PSI5_CRCICLR_CRCI10_OFF (10u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI11 */
#define IFX_PSI5_CRCICLR_CRCI11_OFF (11u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI12 */
#define IFX_PSI5_CRCICLR_CRCI12_OFF (12u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI13 */
#define IFX_PSI5_CRCICLR_CRCI13_OFF (13u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI14 */
#define IFX_PSI5_CRCICLR_CRCI14_OFF (14u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI15 */
#define IFX_PSI5_CRCICLR_CRCI15_OFF (15u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI16 */
#define IFX_PSI5_CRCICLR_CRCI16_OFF (16u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI17 */
#define IFX_PSI5_CRCICLR_CRCI17_OFF (17u)

/** \brief Length for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_LEN (1u)

/** \brief Mask for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_CRCICLR_Bits.CRCI18 */
#define IFX_PSI5_CRCICLR_CRCI18_OFF (18u)

